       IDENTIFICATION DIVISION.
       PROGRAM-ID. TESTFILE.
       AUTHOR. WILLIAM.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TESTVALUE1 PIC X(10) VALUE "HELLO".
       01 TESTVALUE2 PIC X(10) VALUE "WORLD".
       01 FULLVALUE PIC X(20). 
       01 TESTNUM1 PIC 9 VALUE ZERO.
       01 TESTNUM2 PIC 9(3) VALUE ZEROS.
       01 TOTALVALUE PIC 9(3) VALUE ZEROS.

       PROCEDURE DIVISION.
       MOVE 8 TO TESTNUM1.
       MOVE 134 TO TESTNUM2.
       COMPUTE TOTALVALUE = TESTNUM1 + TESTNUM2.

       DISPLAY TOTALVALUE.

       DISPLAY TESTVALUE1.
       DISPLAY TESTVALUE2.

       STRING TESTVALUE1 DELIMITED BY SIZE
       SPACE
       TESTVALUE2 DELIMITED BY SIZE
       INTO 
       FULLVALUE.

       DISPLAY FULLVALUE.

       STOP RUN.
